In [3]:
import pandas as pd

In [5]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [7]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [13]:
states = pd.DataFrame({'population' : population, 'area' : area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [16]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [18]:
states.columns

Index(['population', 'area'], dtype='object')

In [20]:
states.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [27]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [29]:
pd.DataFrame({'population' : population})

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [36]:
data_dict = [{'a' : i, 'b' : 2 * i} for i in range(3)]
data = pd.DataFrame(data_dict)
data

   a  b
0  0  0
1  1  2
2  2  4

In [38]:
import numpy as np

In [76]:
pd.DataFrame(np.random.RandomState().randn(3, 2),
             columns = ['foo', 'bar'],
             index = ['a', 'b', 'c'])

        foo       bar
a -1.147036  0.030063
b -0.512481 -1.706825
c -0.047461 -0.222044

In [77]:
pd.DataFrame(np.random.rand(3, 2),
             columns = ['foo', 'bar'],
             index = ['a', 'b', 'c'])

        foo       bar
a  0.924995  0.466858
b  0.611032  0.619229
c  0.566075  0.130873

In [84]:
A = np.zeros(3, dtype = [('A', 'i8'), ('B', 'i8')])
A

array([(0, 0), (0, 0), (0, 0)], dtype=[('A', '<i8'), ('B', '<i8')])

In [86]:
pd.DataFrame(A)

   A  B
0  0  0
1  0  0
2  0  0

In [93]:
rng = np.random.RandomState(42).randn(3, 2)
type(rng)

numpy.ndarray

In [105]:
ind = pd.Index([2, 3, 5, 7, 11], dtype = 'i')
ind[1]

np.int32(3)

In [107]:
ind[::2]

Index([2, 5, 11], dtype='int32')

In [110]:
ind[ind % 2 != 0]

Index([3, 5, 7, 11], dtype='int32')

In [112]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int32

In [119]:
type(ind)

pandas.core.indexes.base.Index

In [124]:
pd.DataFrame(ind, columns = ['ind'])

   ind
0    2
1    3
2    5
3    7
4   11

In [148]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [153]:
indA & indB

Index([0, 3, 5, 7, 9], dtype='int64')